#Dataset

BOT_CONFIG = {
    'intents': {
        'hello': {
            'examples': ['Привіт', 'Доброго дня', 'Вітаю', 'Здравствуйте', 'Привітання', 'Доброго ранку', 'Доброго вечора!', 'Добрий день!', 'Хеллоу!', 'Салют!', 'Hello', 'HI'],
            'responses': ['Вітаю! Як я можу вам допомогти?', 'Здравствуйте! Дуже приємно вас бачити!']
        },
        'bye': {
            'examples': ['До побачення', 'До зустрічі', 'Прощавай', 'Добраніч', 'Goodbye', 'Бувай', 'До скорої зустрічі', 'Дякую'],
            'responses': ['До побачення!', 'До зустрічі! Нехай вам щастить!', 'Goodbye! Have a great day!', 'До скорої зустрічі! Буду тут, якщо вам потрібна допомога.']
        },
        'help': {
            'examples': ['Допоможіть', 'Потрібна допомога', 'Я не розумію', 'Що робити в цьому боті?'],
            'responses': ['Звісно, я готовий вам допомогти. Якщо у вас є питання, просто запитайте.', 'Я готовий вам надати необхідну інформацію. Як я можу допомогти?']
        },
        'greeting': {
            'examples': ['Як справи?', 'Як ви почуваєтесь?', 'Вітаю вас', 'Як ви?', 'Всім привіт!', 'Привітання!'],
            'responses': ['Спасибі за запитання, все гаразд. Як я можу вам допомогти?', 'Дуже добре, дякую. Як я можу вам допомогти?']
        },
        'wikipedia': {
            'examples': ['Що таке машинне навчання?', 'Хто такий Ілон Маск?', 'Як працює сонячна енергія?', 'Історія Римської імперії'],
            'responses': ["Машинне навчання - це галузь штучного інтелекту, яка вивчає, як комп'ютери можуть навчитися робити різні завдання без явного програмування.",
                          'Ілон Маск - відомий підприємець та засновник компаній SpaceX та Tesla, який працює над розвитком космічних технологій та автономних автомобілів.',
                          'Сонячна енергія генерується з використанням сонячних панелей, які перетворюють сонячне випромінювання в електроенергію.',
                          'Римська імперія була давньою імперією, яка існувала близько тисячу років і охоплювала багато частин Європи, Азії та Африки.']
        },
        'news': {
            'examples': ['Останні новини', 'Свіжі новини', 'Новини про технології', 'Політичні новини'],
            'responses': ['На жаль, я не можу надавати актуальні новини. Рекомендую перевірити відповідні новинні джерела для останніх оновлень.']
        },
        'history': {
            'examples': ['Історія України', 'Середньовіччя', 'Друга світова війна', 'Великий поштовх'],
            'responses': ['Історія України багато в чому цікава та складна. Залежно від вашого запиту, я можу поділитися коротким оглядом історичних подій.',
                          'Середньовіччя - це епоха в історії, яка включає багато важливих подій та культурних змін.',
                          'Друга світова війна була найбільшою війною в історії, яка змінила світовий ландшафт і мала серйозний вплив на події.',
                          'Великий поштовх був важливим відкриттям в фізиці та мав великий вплив на розвиток науки.']
        },
        'books': {
            'examples': ['Рекомендації щодо книг', 'Що почитати?', 'Улюблені автори'],
            'responses': ['Книги - це джерело незабутніх пригод. Я можу порекомендувати вам деякі цікаві книги для читання.']
        },
        'sports': {
            'examples': ['Спорт', 'Футбол', 'Баскетбол', 'Фітнес', 'Здоровий спосіб життя'],
            'responses': ['Спорт - це важливий аспект здорового способу життя. Я можу розповісти про різні види спорту та тренувань.']
        },
        'movies': {
            'examples': ['Рекомендації щодо фільмів', 'Останні кіноновини', 'Фільми з улюбленими акторами'],
            'responses': ['Фільми - це чудовий спосіб розважитися. Я можу порекомендувати вам кілька цікавих фільмів для перегляду.']
        },
    },
    'failure_phrases': [
        'Вибачте, я ще навчаюсь і не розумію цього запиту. Спробуйте інший запит, будь ласка.',
        'Моя база даних не містить інформації щодо цього запиту. Можливо, я зможу вам допомогти з іншою темою?',
        'На жаль, наразі я не можу розуміти вашого запиту. Можливо, у мене є інші корисні функції, які я можу виконати.',
        'Це завдання за моїми можливостями, але я завжди намагатимусь вчитися і поліпшуватися.',
        'Схоже, я потрапив в ліс. Можливо, ви можете задати мені інший запит?'
    ]
}

X_texts = []  #речення
y = []  #їх класси

for intent, intent_data in BOT_CONFIG['intents'].items():
    for example in intent_data ['examples']:
        X_texts.append(example)
        y.append(intent)


##Vectorization##
from sklearn.feature_extraction.text import CountVectorizer
vectorizer = CountVectorizer()
X = vectorizer.fit_transform(X_texts)

vectorizer.get_feature_names_out()



##Learning##
from sklearn.linear_model import LogisticRegression
clf = LogisticRegression().fit(X, y)
clf.predict(vectorizer.transform(['привіт', 'спорт', 'історія']))

probas = clf.predict_proba(vectorizer.transform(['привіт']))[0]
max(probas)



##Validation##

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.feature_extraction.text import CountVectorizer
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.svm import LinearSVC

vectorizer = TfidfVectorizer(analyzer='char_wb', ngram_range=(2, 4))

scores = []

for i in range(10):
    X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33)
    clf = LinearSVC(dual=False).fit(X_train, y_train)
    score = clf.score(X_test, y_test)
    scores.append(score)

average_score = sum(scores) / len(scores)

clf = LinearSVC(dual=False).fit(X, y)
final_score = clf.score(X, y)


        
